/**
*UVa11892
*当每堆石子都为1时，N是奇数则先手必胜，N是偶数则后手必胜
*当存在有不为1的堆时，先手有策略使后手面临偶数堆1的局面，即先手必胜
*方法是：设有m个不为1的堆，先手选择其中的m-1个，每次都取到该堆只剩下1个石子
*根据游戏规则，后手只能选取该堆取剩下的1个
*对于最后一个不为1的堆，先手取完该堆的石子或者取到只剩1个石子将决定
*后手面临的全为1的局面是有奇数堆还是有偶数堆
*先手可以选择使后手面临偶数个全为1的堆构成的局面，则后手必败先手必胜
*后手必胜当且仅当每堆石子都是1，且有偶数堆
*/

#include <bits/stdc++.h>
using namespace std;

int main()
{
    int T;
    scanf("%d", &T);
    while(T--){
        int N, x, cnt = 0;
        scanf("%d", &N);
        for(int i = 0; i < N; i++){
            scanf("%d", &x);
            if(x == 1){
                cnt++;
            }
        }
        if(cnt == N && cnt % 2 == 0){
            puts("piloop");
        }
        else{
            puts("poopi");
        }
    }
    return 0;
}
